{
  "metadata": {
    "filename": "PAS - GAM Software upgrade procedure v1.8.2.pdf",
    "total_pages": 10,
    "size_bytes": 1780390,
    "size_mb": 1.7
  },
  "chunks": [
    {
      "chunk_id": 1,
      "pages": "1-10",
      "content": "--- Page 1 ---\nSeptember 12, 2025  \n \n \n \n \n  \n \n \n \n \n \n \n \nGAM FW Upgrade Procedure \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n\n\n--- Page 2 ---\n \nSeptember 12, 2025  2 \n \n1. Use Windows File Explorer app or an FTP client like Filezilla to connect to Positron FTP Server \nusing the link shown below.   \n                                                                   \n \nftp://ftp.positronaccess.com/  \nNote: Do not use any Web Browsers due they block ftp downloads .  \n \nFigure 1 Connecting with Positron FTP Server using File Explorer \n \n2. Once the Log On window be prompted, use the following credentials: \n \nUsername:  positron \nPassword:  PAS1010!#! \n \nFigure 2 FTP Log On window \n\n\n--- Page 3 ---\n \nSeptember 12, 2025  3 \n \n3. Select GAM folder and open it by double clicking on it. \n \nFigure 3 GAM folder in Positron FTP Server \n \n4. For GAMs working with any old G1000-C Endpoint it is necessary to upgrade first to v1.5.1 (see \nFigure 4) before going to latest v 1.8.2. \nPlease read IMPORTANT NOTES A and B on pages 5 and 6 \n \n \nFigure 4 Folder with FW 1.5.1 for GAM working with G1000-C \n \n \n \n \n \n\n\n--- Page 4 ---\n \nSeptember 12, 2025  4 \n \n5. For GAMs working with G1001, G1002, G2002 Endpoint series go to folder v1.8.2 (see Figure 5) \n \nFigure 5 Folder with FW for GAM working with G1001/G1002/G2002 \n \n6. Each GAM type, indoor/outdoor/MIMO/Coax has a different folder . (see Figure 6),  \n \n \nFigure 6 Folders with FW for different models of GAM \na. gam12-24_coax_1_X_X_r2XXXX  is for Indoor GAM-12-C  or GAM-24-C  \nb. gam12-24_mimo_1_X_X_r2XXXX  is for Indoor GAM-12-M  or GAM-24-M  \nc. gam4-8_coax_1_X_X_r2XXXX  is for Outdoor GAM-4-CX or GAM-4-CRX  \nd. gam4-8_mimo_1_X_X_r2XXXX  is for Outdoor GAM-4-MX  , GAM-8-MX, GAM-4-MRX  or GAM-8-\nMRX \n\n\n--- Page 5 ---\n \nSeptember 12, 2025  5 \n \n7. Once you locate the right folder, open it and proceed to download the file with “ .mfip” \nextension into your PC, see Figure 7. For Example: for a GAM12/24-M the file will be \nftp://ftp.positronaccess.com/GAM/v1.8.2/gam12-24_mimo_1_8_2_r28146/  \n \n \n \n \n \nFigure 7 Firmware load for GAM 12/24-M working with G1001/G1002/G2002 series \n \nThe GAM doesn’t validate if you are using the proper file for the GAM model in older versions, validation \nwas implemented from v1.5.0.r22842, it is important to select the correct file if you a running an older \nversion. \n \nIMPORTANT NOTES: \nA. IF YOU ARE RUNNING A VERSION PRIOR OF 1.5.1 AND HAVE LEGACY G1000-C (COAX ONLY) \nIN YOUR NETWORK, YOU MUST UPGRADE TO V1.5.1 PRIOR TO UPGRADE TO 1.7.0, IF NOT, \nYOU WILL BE STUCK WITH ENDPOINTS THAT WILL NEVER UPGRADE.                             \nVERSION 1.5.1 IS LOCATED IN ftp://ftp.positronaccess.com/GAM/v.1.5.1-G1000-C-cleanup-\nonly/ AS SHOWN IN Figure 8 and Figure 9 \n\n\n--- Page 6 ---\n \nSeptember 12, 2025  6 \n \n \nFigure 8 Folder with GAM FW V 1.5.1  \n \n \n \nFigure 9 Folders with FW V 1.5.1 for Coax GAMs \n \nB. IF THE GAM IS RUNNING A VERSION OLDER THAN 1.2.0(BUILD r21298), THERE IS A RARE CASE \nOF FLASH CORUPTION THAT CAN OCCUR DURING THE UPGRADE. CHECK WITH SALES \nENGINEERING TEAM FIRST. \n \n8. Download the  .mfip file to your PC. \n9. Open GAM Web GUI on your PC. \n\n\n--- Page 7 ---\n \nSeptember 12, 2025  7 \n \n10. Copy running-config to startup-config of the GAM by doing click on floppy disk symbol located in \ntop right corner of Web GUI as shown in Figure 10 or from menu \nMaintenance Configuration  Save startup-config  \n \n \nFigure 10  Copy running-config to startup-config button \n \n11. Under Maintenance Software  select Update From File, see Figure 11 .  \n12. Click on Choose File  button to locate the  .mfip file downloaded previously in your PC then press \nOpen button to confirm, see Figure 12 . \n13. Click the Upload button as shown in Figure 13  to start the update process, \n \n \n \nFigure 11  Update From File menu  \n \nFigure 12  Selecting new GAM Firmware \n \n \nFigure 13  Starting Update Process \nClick Here \nSelect the .mfip file \nClick Here \nClick Here \n\n--- Page 8 ---\n \nSeptember 12, 2025  8 \n \n14. The GAM will show the status of firmware update process as shown below in Figure 14  \n \n \nFigure 14  GAM FW update status \n \n15. Firmware update will take a few minutes, the GAM will be rebooted automatically once the new \nfirmware be loaded into the flash. (Aprox 7-10 mins) \n16. Once GAM FW update is completed, a Completed message will appear in Web GUI confirming it \nand asking for Login credentials. \n \nNote: Do not Power Off or reboot the GAM immediately after the upgrade, leave it On for at \nleast 10 minutes to allow all G.hn ports be updated to the new version. \n \n \nFigure 15  GAM FW update completed \n \n \n \n \n \n \n \n \n \n\n\n--- Page 9 ---\n \nSeptember 12, 2025  9 \n \n17. To validate new firmware installed in the GAM go to MonitorSystemInformation  to \nconfirm that the GAM is working with new firmware version and release, see Figure 16 . \n \n \nFigure 16  Checking new gam FW version \n18. Immediately after the GAM was updated the endpoints could be showing a software mismatch \nwarning        at  MonitorG.HnOverview . \n19. Starting on GAM FW v.1.6.0, Endpoint Automatic Firmware Upgrade feature is set to Enable by \ndefault at Configuration G.hnGlobal Configuration , see Figure 17 . Endpoint will start to \nupdate/reboot and then come back online with new FW. \n20. Manual update of endpoints firmware is also possible but will be performed one by one, to \nproceed set Endpoint Automatic Firmware Upgrade  feature to Disable, go to \nMonitorG.hnOverview , click on the MAC address of the endpoint and press the “ upgrade \nendpoint ” button, it will take 1min to complete the upgrade.   \n \n\n\n--- Page 10 ---\n \nSeptember 12, 2025  10 \n \n  \nFigure 17  Endpoint Automatic Firmware Upgrade Coax GAM \n \n \n \nFigure 18  Endpoint Automatic Firmware Upgrade Copper Pairs GAM \n \n21.  Sometimes the endpoint doesn’t seem to upgrade properly or the g.hn link goes up and down, \nin that case we recommend to power cycle the endpoint to fix it. If the issue persists, press and \nhold the reset button on the endpoint for 15 seconds, it will factory default the endpoint and \nfirmware upgrade should be done again (manually or automatically). \n22. In case Web GUI of GAM does not display MonitorG.hnoverview  information properly after \nfirmware upgrade it is necessary to clear cache  of your browser or open a new page in \nprivate/incognito mode. \nDefault Enable \nDefault Enable \n"
    }
  ]
}